SOAP/src/main/resources/SOAP1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://kodilla.com/courses/soap">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:getCourseRequest>
         <soap:name>Web Developer Plus</soap:name>
      </soap:getCourseRequest>
   </soapenv:Body>
</soapenv:Envelope>